// JavaScript Document
var activitys = [
    {
        "id": "1",
        "name": "第十五届“中国少年作家杯”全国征文大赛",
        "photo": "images/community/activity1.jpg",
        "status": "已结束",
        "date": "2014年01月01日-2014年05月01日",
        "abstract": "第十五届中国少年作家杯”全国征文大赛由中国少年作家班、中国小说学会、漓江出版社、中文在线、中国少年作家学会、北京守望文化艺术交流中心等单位联合举办，即日起开始征稿。",
        "activityContent": "<p>第十五届中国少年作家杯”全国征文大赛由中国少年作家班、中国小说学会、漓江出版社、中文在线、中国少年作家学会、北京守望文化艺术交流中心等单位联合举办，即日起开始征稿。第十五届中国少年作家杯”全国征文大赛由中国少年作家班、中国小说学会、漓江出版社、中文在线、中国少年作家学会、北京守望文化艺术交流中心等单位联合举办，即日起开始征稿。第十五届中国少年作家杯”全国征文大赛由中国少年作家班、中国小说学会、漓江出版社、中文在线、中国少年作家学会、北京守望文化艺术交流中心等单位联合举办，即日起开始征稿。第十五届中国少年作家杯”全国征文大赛由中国少年作家班、中国小说学会、漓江出版社、中文在线、中国少年作家学会、北京守望文化艺术交流中心等单位联合举办，即日起开始征稿。第十五届中国少年作家杯”全国征文大赛由中国少年作家班、中国小说学会、漓江出版社、中文在线、中国少年作家学会、北京守望文化艺术交流中心等单位联合举办，即日起开始征稿。第十五届中国少年作家杯”全国征文大赛由中国少年作家班、中国小说学会、漓江出版社、中文在线、中国少年作家学会、北京守望文化艺术交流中心等单位联合举办，即日起开始征稿。</p><p>获奖选手奖品如下：</p><p>一等奖一名，二等奖5名，三等奖20名;第一名（冠军或一等奖）30000元、第二名（亚军或二等奖）20000元、第三名（季军或三等奖）10000元。参加各级比赛奖给选手个人的奖品、奖金一律个人所有，比赛相关文件及证书复印件由各单位办公室（综合部）存档。</p>"
    },
    {
        "id": "2",
        "name": "2014年马年画马专题活动",
        "photo": "images/community/activity2.jpg",
        "status": "已结束",
        "date": "2014年02月22日-2014年05月26日",
        "abstract": "无论是车水马龙的繁华，还是一马平川的辽远，无论是青梅竹马的甜蜜，还是西风瘦马的冷清……任何与“马”或含“马”字的成语有关的题材均可。放飞你的想像，让画笔飞起来吧！",
        "activityContent": "<p>无论是车水马龙的繁华，还是一马平川的辽远，无论是青梅竹马的甜蜜，还是西风瘦马的冷清……任何与“马”或含“马”字的成语有关的题材均可。放飞你的想像，让画笔飞起来吧！无论是车水马龙的繁华，还是一马平川的辽远，无论是青梅竹马的甜蜜，还是西风瘦马的冷清……任何与“马”或含“马”字的成语有关的题材均可。放飞你的想像，让画笔飞起来吧！无论是车水马龙的繁华，还是一马平川的辽远，无论是青梅竹马的甜蜜，还是西风瘦马的冷清……任何与“马”或含“马”字的成语有关的题材均可。放飞你的想像，让画笔飞起来吧！无论是车水马龙的繁华，还是一马平川的辽远，无论是青梅竹马的甜蜜，还是西风瘦马的冷清……任何与“马”或含“马”字的成语有关的题材均可。放飞你的想像，让画笔飞起来吧！无论是车水马龙的繁华，还是一马平川的辽远，无论是青梅竹马的甜蜜，还是西风瘦马的冷清……任何与“马”或含“马”字的成语有关的题材均可。放飞你的想像，让画笔飞起来吧！</p><p>获奖选手奖品如下：</p><p>一等奖一名，二等奖5名，三等奖20名;第一名（冠军或一等奖）30000元、第二名（亚军或二等奖）20000元、第三名（季军或三等奖）10000元。参加各级比赛奖给选手个人的奖品、奖金一律个人所有，比赛相关文件及证书复印件由各单位办公室（综合部）存档。</p>"
    },
    {
        "id": "3",
        "name": "第五届全国中小学信息技术创新与实践活动",
        "photo": "images/community/activity3.jpg",
        "status": "已结束",
        "date": "2014年06月22日-2014年07月22日",
        "abstract": "7月22日下午，第八届全国中小学信息技术创新与实践活动（简称NOC）教师赛项决赛闭幕式暨颁奖典礼在江南大学文浩科技馆隆重召开。随着第八届中小学NOC活动教师赛项决赛的结束，第八届中小学NOC活动全国决赛也随之圆满地落下帷幕。",
        "activityContent": "<p>7月22日下午，第八届全国中小学信息技术创新与实践活动（简称NOC）教师赛项决赛闭幕式暨颁奖典礼在江南大学文浩科技馆隆重召开。随着第八届中小学NOC活动教师赛项决赛的结束，第八届中小学NOC活动全国决赛也随之圆满地落下帷幕。7月22日下午，第八届全国中小学信息技术创新与实践活动（简称NOC）教师赛项决赛闭幕式暨颁奖典礼在江南大学文浩科技馆隆重召开。随着第八届中小学NOC活动教师赛项决赛的结束，第八届中小学NOC活动全国决赛也随之圆满地落下帷幕。7月22日下午，第八届全国中小学信息技术创新与实践活动（简称NOC）教师赛项决赛闭幕式暨颁奖典礼在江南大学文浩科技馆隆重召开。随着第八届中小学NOC活动教师赛项决赛的结束，第八届中小学NOC活动全国决赛也随之圆满地落下帷幕。</p><p>获奖选手奖品如下：</p><p>一等奖一名，二等奖5名，三等奖20名;第一名（冠军或一等奖）30000元、第二名（亚军或二等奖）20000元、第三名（季军或三等奖）10000元。参加各级比赛奖给选手个人的奖品、奖金一律个人所有，比赛相关文件及证书复印件由各单位办公室（综合部）存档。</p>"
    },
    {
        "id": "4",
        "name": "2014年北京市中小学奥林匹克教育系列活动启动",
        "photo": "images/community/activity4.jpg",
        "status": "进行中",
        "date": "2014年04月16日-2014年11月01日",
        "abstract": "4月16日，2014年北京市中小学奥林匹克教育系列活动在朝阳区十八里店小学启动。活动将以“奔跑、运动、成长”和“支持申办冬奥，实现中国梦想”为两大主线，整合全市教育和体育系统青少年体育赛事资源，开展30多项奥林匹克教育系列活动。",
        "activityContent": "<p>4月16日，2014年北京市中小学奥林匹克教育系列活动在朝阳区十八里店小学启动。活动将以“奔跑、运动、成长”和“支持申办冬奥，实现中国梦想”为两大主线，整合全市教育和体育系统青少年体育赛事资源，开展30多项奥林匹克教育系列活动。4月16日，2014年北京市中小学奥林匹克教育系列活动在朝阳区十八里店小学启动。活动将以“奔跑、运动、成长”和“支持申办冬奥，实现中国梦想”为两大主线，整合全市教育和体育系统青少年体育赛事资源，开展30多项奥林匹克教育系列活动。4月16日，2014年北京市中小学奥林匹克教育系列活动在朝阳区十八里店小学启动。活动将以“奔跑、运动、成长”和“支持申办冬奥，实现中国梦想”为两大主线，整合全市教育和体育系统青少年体育赛事资源，开展30多项奥林匹克教育系列活动。</p><p>获奖选手奖品如下：</p><p>一等奖一名，二等奖5名，三等奖20名;第一名（冠军或一等奖）30000元、第二名（亚军或二等奖）20000元、第三名（季军或三等奖）10000元。参加各级比赛奖给选手个人的奖品、奖金一律个人所有，比赛相关文件及证书复印件由各单位办公室（综合部）存档。</p>"
    }
    ,
    {
        "id": "5",
        "name": "2014年小学足球联赛周五启动",
        "photo": "images/community/activity5.jpg",
        "status": "进行中",
        "date": "2014年07月20日-2014年11月01日",
        "abstract": "第一届广州市中小学校园足球联赛将于周五启动，有超过5000名学生参赛，一共踢360场。",
        "activity-content": "第一届广州市中小学校园足球联赛将于周五启动，有超过5000名学生参赛，一共踢360场。昨日，广州市教育局和体育局召开新闻发布会通报称，决赛周将由160支队伍出线争夺九大奖杯。第一届广州市中小学校园足球联赛将于周五启动，有超过5000名学生参赛，一共踢360场。"
    }
]
/*var activitysContainer = document.getElementById('activitys-container')
 count = activitys.length
 template = getTemplate('activitys')
 for (var i = 0; i < count; ++i) {
 activitysContainer.appendChild(dataToElement(activitys[i], template))
 }*/


function getActivityById(id) {
    var result = activitys.find({id: id});
    if (result.length > 0)
        return result[0];
    return null;
}
function getActivitys(c, sc) {
    var filter = {};
    filter[c] = sc;
    return activitys.find(filter);
}